# language: ru

Функция: Проверка подтвержденной почты и статуса пользователя NEW

Предыстория:
    Дано Я открываю главную страницу
    # И Я ожидаю заданное время

Сценарий: Проверка подтвержденной почты пользователя
#     Когда Я нажимаю кнопку "Вход"
#     И Я ввожу "Почта пользователя" в "Поле e-mail"
#     И Я ввожу "Пароль игрока" в "Поле password"
#     И Я нажимаю кнопку "Войти"
#     И Я нажимаю кнопку "Профиль"
#     Тогда Я вижу "почта подтвержденна"

# Сценарий: Проверка статуса NEW пользователя
#     Когда Я нажимаю кнопку "Войти"
#     Тогда Я вижу "статус NEW"