# language: ru

Функция: Проверка подтвержденной почты и статуса пользователя NEW

Предыстория:
    Дано Я открываю главную страницу "ROX" на окружении "PROD"
    И Я ожидаю заданное время

Сценарий: Проверка подтвержденной почты пользователя
    Когда Я нажимаю кнопку "Вход" в "Хэдер"
    И Я ввожу "Почта пользователя" в "Поле e-mail" на странице "Авторизации"
    И Я ввожу "Пароль пользователя" в "Поле password" на странице "Авторизации"
    И Я нажимаю кнопку "Войти" на странице "Авторизации"
    #И Я нажимаю кнопку "Закрыть" на странице "Касса"
    И Я нажимаю кнопку "Профиль" в "Хэдер"
    Тогда Я вижу "почта подтвержденна" на странице "Профиль"

Сценарий: Проверка статуса NEW пользователя
    Когда Я нажимаю кнопку "Профиль" в "Хэдер"
    Тогда Я вижу "статус NEW" на странице "Профиль"